[
  {
    "id": "XDRInternals",
    "Owners": "FBader",
    "Description": "The unofficial API cmdlet to interact with the Microsoft Defender XDR portal",
    "Score": 70,
    "Published": "2026-02-01T17:54:31.687"
  },
  {
    "id": "Sql",
    "Owners": "CedX",
    "Description": "A simple micro-ORM, based on ADO.NET and data annotations.",
    "Score": 70,
    "Published": "2026-02-01T20:41:47.017"
  },
  {
    "id": "AzureDevOpsDscv3",
    "Owners": "mimachniak",
    "Description": "Module with DSC Resources for deployment and configuration of Azure DevOps Server/Services supporting DSC v3.",
    "Score": 65,
    "Published": "2026-02-01T18:11:08.4"
  },
  {
    "id": "systemchecks",
    "Owners": "mmhilbert",
    "Description": "PowerShell module for building comprehensive system health checks and infrastructure validations",
    "Score": 50,
    "Published": "2026-02-01T21:13:50.39"
  },
  {
    "id": "Microsoft-Secure-Score-Assessment-Toolkit",
    "Owners": "Mohammedsiddiqui",
    "Description": "A powerful PowerShell toolkit for assessing Microsoft 365 security posture through the Microsoft Secure Score API. Generate comprehensive, interactive HTML reports with 411+ security controls directly from Microsoft Graph API. Features include real-time data fetching, interactive filtering, floating action buttons, and direct links to configuration portals. Perfect for security assessments, compliance reporting, and continuous security monitoring.",
    "Score": 50,
    "Published": "2026-02-01T10:06:36.153"
  },
  {
    "id": "WindmillClient",
    "Owners": "rubenfiszel",
    "Description": "Client for the Windmill platform.",
    "Score": 50,
    "Published": "2026-02-01T21:04:16.933"
  },
  {
    "id": "PsPatchMyPC",
    "Owners": "thomastysong",
    "Description": "Enterprise application patching module integrating winget with PatchMyPC-style orchestration and Nudge-inspired progressive enforcement. Supports deferrals, notifications, dual logging, and orchestrator-agnostic deployment.",
    "Score": 45,
    "Published": "2026-02-01T13:09:26.573"
  },
  {
    "id": "WindowsUpdateTools",
    "Owners": "AlexAppleton",
    "Description": "Comprehensive PowerShell module for diagnosing, analyzing, and remediating Windows Update issues in enterprise environments. Includes SetupDiag integration, automated remediation, and detailed health reporting.",
    "Score": 45,
    "Published": "2026-02-02T00:17:39.48"
  },
  {
    "id": "HermesConsoleUI",
    "Owners": "DavidPrietoDev",
    "Description": "Professional PowerShell Console UI Framework - A comprehensive, zero-dependency toolkit for building beautiful terminal applications. Includes 40 functions (11 text, 7 visual, 10 interactive, 12 core) with full theme support, internationalization (i18n), and PowerShell 2.0+ compatibility.",
    "Score": 40,
    "Published": "2026-02-01T12:16:40.307"
  },
  {
    "id": "ArgosCCF",
    "Owners": "DavidPrietoDev",
    "Description": "ArgosCCF (formerly CCF) is a professional PowerShell framework for secure configuration, logging, plugin management, and parallel execution. Designed for high-integrity automation and security hardening.",
    "Score": 40,
    "Published": "2026-02-01T12:16:43.28"
  }
]