[
  {
    "id": "Html",
    "Owners": "CedX",
    "Description": "A simple template engine for rendering HTML documents.",
    "Score": 70,
    "Published": "2026-02-28T21:58:59.737"
  },
  {
    "id": "MountAws",
    "Owners": "andyalm",
    "Description": "An experimental powershell provider that allows you to browse various aws services as a filesystem",
    "Score": 70,
    "Published": "2026-02-28T16:41:03.667"
  },
  {
    "id": "PowerPlatformChecker",
    "Owners": "AutoSysOps",
    "Description": "PowerShell module to check Power Platform solutions.",
    "Score": 65,
    "Published": "2026-02-28T17:47:42.85"
  },
  {
    "id": "PowerNetbox",
    "Owners": "ctrl-alt-automate",
    "Description": "PowerNetbox - The comprehensive PowerShell module for Netbox REST API with 100% coverage. Fork of NetboxPS (Ben Claussen) with full Netbox 4.x compatibility. 488+ functions for DCIM, IPAM, Virtualization, Circuits, Tenancy, VPN, Wireless, Extras, Core, Users. Cross-platform (Windows, Linux, macOS).",
    "Score": 55,
    "Published": "2026-02-28T11:32:27.88"
  },
  {
    "id": "TLSleuth",
    "Owners": "MadCrabCyder",
    "Description": "TLSleuth is an open-source PowerShell module for inspecting TLS\r\nendpoints and certificate details from scripts or the command line.\r\n\r\nIt provides clean, structured, script-friendly output for operators,\r\nengineers, and automation pipelines that need reliable TLS insight.",
    "Score": 55,
    "Published": "2026-02-28T04:22:53.13"
  },
  {
    "id": "PSSecretScanner",
    "Owners": "bjompen",
    "Description": "Scan for secrets in code to prevent accidentaly commited secrets",
    "Score": 50,
    "Published": "2026-02-28T14:36:10.747"
  },
  {
    "id": "psTerminalPerfCounter",
    "Owners": "gabrielkoehl",
    "Description": "A PowerShell module for displaying real-time graphs of Windows Performance Counters directly in the terminal console. This module provides an easy way to visualize system performance metrics without requiring external graphing tools or GUI applications by using templates and multilanguage support.",
    "Score": 45,
    "Published": "2026-02-28T18:51:37.72"
  },
  {
    "id": "Syskit.Discovery",
    "Owners": "tfrankola",
    "Description": "Syskit Discovery: M365 Security Assessment for Microsoft 365 environments, including Exchange mailboxes, SharePoint sites, and Entra ID users. Uses Graph REST API and PnP PowerShell for comprehensive reporting. Includes license optimization analysis, SharePoint sharing security analysis, sensitivity label compliance, external users enumeration, ad-hoc permissions detection, and anonymous sharing links tracking. Optimized for large tenants with targeted sampling approach.",
    "Score": 40,
    "Published": "2026-03-01T00:06:40.033"
  },
  {
    "id": "PSAIModelSearch",
    "Owners": "DougFinke",
    "Description": "Search and inspect models.dev API catalog data.",
    "Score": 40,
    "Published": "2026-02-28T11:47:04.627"
  },
  {
    "id": "PSAISuite",
    "Owners": "DougFinke",
    "Description": "PowerShell module for simple, unified interface to multiple Generative AI providers",
    "Score": 40,
    "Published": "2026-02-28T13:26:21.107"
  }
]