[
  {
    "id": "xDnsServer",
    "Owners": "PowerShellTeam,gaelcolas,dsccommunity",
    "Description": "This module contains DSC resources for the management and configuration of Windows Server DNS Server.",
    "MetadataScore": 10
  },
  {
    "id": "xDatabase",
    "Owners": "PowerShellTeam,gaelcolas,dsccommunity",
    "Description": "This module contains 2 resources. xDatabase allows to create and deploy databases using DAC or connection string, restore a database using BACPAC and delete a database. The xDBPackage resource allows extracting a database to a DACPAC or exporting to a BACPAC",
    "MetadataScore": 10
  },
  {
    "id": "xCredSSP",
    "Owners": "PowerShellTeam,gaelcolas,dsccommunity",
    "Description": "This module contains DSC resources for configuration of the WSMan Credential Security Support Provider (CredSSP).",
    "MetadataScore": 10
  },
  {
    "id": "SharePointDSC",
    "Owners": "PowerShellTeam,gaelcolas,dsccommunity",
    "Description": "This DSC module is used to deploy and configure SharePoint Server 2013, 2016 and 2019, and covers a wide range of areas including web apps, service apps and farm configuration.",
    "MetadataScore": 10
  },
  {
    "id": "Pscx",
    "Owners": "r_keith_hill,x0n",
    "Description": "PowerShell Community Extensions (PSCX) base module which implements a general purpose set of Cmdlets.",
    "MetadataScore": 10
  },
  {
    "id": "Pester",
    "Owners": "nohwnd,fflaten",
    "Description": "Pester provides a framework for running BDD style Tests to execute and validate PowerShell commands inside of PowerShell and offers a powerful set of Mocking Functions that allow tests to mimic and mock the functionality of any command inside of a piece of PowerShell code being tested. Pester tests can execute any command or script that is accessible to a pester test file. This can include functions, Cmdlets, Modules and scripts. Pester can be run in ad hoc style in a console or it can be integrated into the Build scripts of a Continuous Integration system.",
    "MetadataScore": 10
  },
  {
    "id": "OfficeOnlineServerDsc",
    "Owners": "PowerShellTeam,gaelcolas,dsccommunity",
    "Description": "The OfficeOnlineServerDsc module provides the ability to install Office Online Server (formerly known as Office Web App Server).",
    "MetadataScore": 10
  },
  {
    "id": "Microsoft365DSC",
    "Owners": "NikCharleboisPFE,Microsoft365DSC_Team",
    "Description": "This DSC module is used to configure and monitor Microsoft tenants, including SharePoint Online, Exchange, Teams, etc.",
    "MetadataScore": 10
  },
  {
    "id": "HAWK",
    "Owners": "matbyrd,SemperCyber1775",
    "Description": "Microsoft 365 Incident Response and Threat Hunting PowerShell tool.\r\n\tThe Hawk is designed to ease the burden on M365 administrators who are performing Cloud forensic tasks for their organization.\r\n\tIt accelerates the gathering of data from multiple sources in the service that be used to quickly identify malicious presence and activity.",
    "MetadataScore": 10
  },
  {
    "id": "GuestConfiguration",
    "Owners": "PowerShellTeam,katiekeim,migreene,nitingup,mbreakey",
    "Description": "The Guest Configuration module is a tool to author custom content for Azure Guest Configuration. These cmdlets build and validate content packages and custom policies, which can then be used in cross-platform configuration management solutions.",
    "MetadataScore": 10
  },
  {
    "id": "dbatools",
    "Owners": "chrissylemaire,FWN,SQLDBAWithABeard,wsmelton,jpomfret",
    "Description": "The community module that enables SQL Server Pros to automate database development and server administration",
    "MetadataScore": 10
  },
  {
    "id": "dbachecks",
    "Owners": "chrissylemaire,SQLDBAWithABeard",
    "Description": "SQL Server Infrastructure validation Tests to ensure that your SQL Server estate is and continues to be compliant with your requirements",
    "MetadataScore": 10
  },
  {
    "id": "ComputerManagementDsc",
    "Owners": "PowerShellTeam,gaelcolas,dsccommunity",
    "Description": "DSC resources for configuration of a Windows computer. These DSC resources allow you to perform computer management tasks, such as renaming the computer, joining a domain and scheduling tasks as well as configuring items such as virtual memory, event logs, time zones and power settings.",
    "MetadataScore": 10
  },
  {
    "id": "Cloudmarque.Azure",
    "Owners": "nathankitchen,Oliver.Atkinson",
    "Description": "Cloudmarque PowerShell Tools for Azure is a deployment and management framework for cloud resources following a DevOps/GitOps methodology aligned with the Cloudmarque Reference Architecture and Operating Model.",
    "MetadataScore": 10
  },
  {
    "id": "ChocoCCM",
    "Owners": "steviecoaster,chocolatey",
    "Description": "This module provides a PowerShell wrapper to Chocolatey Central Management. See https://docs.chocolatey.org/en-us/central-management/ for more information.",
    "MetadataScore": 10
  },
  {
    "id": "Bicep",
    "Owners": "SimonWahlin,StefanIvemo",
    "Description": "A module to run Bicep using PowerShell. The module is a community project built using the Bicep assemblies to provide you with an enhanced Bicep experience directly from PowerShell without having Bicep CLI installed. \n\nThe module also provides the additional features:\n- Generate ARM template parameter files directly from a Bicep file\n- Quickly open the API reference docs by referencing the Bicep types\n- Get the result from a build as a string or hashtable instead of writing to a file\n- Test if a Bicep file is valid without building it\n- Convert JSON objects to Bicep Language\n- Install/Update/Uninstall Bicep CLI\n- Specify output folder when building* and decompiling Bicep/ARM templates\n- Specify output filename when building Bicep files\n- Find modules in private module registries\n- Clear local module cache\n\nFor more information about Bicep, please visit the official Bicep GitHub Repository:\nhttps://github.com/Azure/bicep",
    "MetadataScore": 10
  },
  {
    "id": "AzureAutomationAuthoringToolkit",
    "Owners": "jodoglevy,eamono,AzureAutomationTeam,alsab",
    "Description": "Open the PowerShell console\r\n\r\nRun\r\n\r\nInstall-Module AzureAutomationAuthoringToolkit -Scope CurrentUser\r\n\r\nIf you want the PowerShell ISE to always automatically load the Azure Automation ISE add-on:\r\n\r\nRun\r\n\r\nInstall-AzureAutomationIseAddOn\r\n\r\nIf not:\r\n\r\nAny time you want to use the Azure Automation ISE add-on in the PowerShell ISE, run\r\n\r\nImport-Module AzureAutomationAuthoringToolkit\r\n\r\nin the PowerShell ISE",
    "MetadataScore": 10
  },
  {
    "id": "AGMPowerCLI",
    "Owners": "AnthonyVandewerdt,jeffoconnorau,yogig,jing,satya_srikanth,rajeshkrmekala",
    "Description": "This is a community generated PowerShell Module for Management Console.\nIt provides a method to issue commands to AGM API endpoints, like \"Application\" and \"Host\".\nThis lets you create automation with AGM, or generate your own composite functions.\nMore information can be found here:  https://github.com/Actifio/AGMPowerCLI",
    "MetadataScore": 10
  },
  {
    "id": "Adoxio.Dynamics.DevOps",
    "Owners": "amervitz,adoxio",
    "Description": "Adoxio.Dynamics.DevOps provides functions for performing Microsoft Dynamics 365 development and deployment (DevOps) oriented tasks.",
    "MetadataScore": 10
  },
  {
    "id": "ActPowerCLI",
    "Owners": "AnthonyVandewerdt,jeffoconnorau,jing",
    "Description": "This is a community generated PowerShell Module that can be used to manage Actifio VDP Appliances.  \nIt provides a method to issue udsinfo, udstask and report commands, and Actifio CDS specific task/info commands.\nMore information can be found here:  https://github.com/Actifio/ActPowerCLI",
    "MetadataScore": 10
  },
  {
    "id": "ActiveDirectoryDsc",
    "Owners": "PowerShellTeam,gaelcolas,dsccommunity",
    "Description": "The ActiveDirectoryDsc module contains DSC resources for deployment and configuration of Active Directory.\r\n\r\nThese DSC resources allow you to configure new domains, child domains, and high availability domain controllers, establish cross-domain trusts and manage users, groups and OUs.",
    "MetadataScore": 10
  },
  {
    "id": "ActiveDirectoryCSDsc",
    "Owners": "PowerShellTeam,gaelcolas,dsccommunity",
    "Description": "DSC resources for installing, uninstalling and configuring Certificate Services components in Windows Server.",
    "MetadataScore": 10
  },
  {
    "id": "AWS.Tools.PCS",
    "Owners": "aws-dotnet-sdk-team",
    "Description": "The PCS module of AWS Tools for PowerShell lets developers and administrators manage AWS Parallel Computing Service from the PowerShell scripting environment. In order to manage each AWS service, install the corresponding module (e.g. AWS.Tools.EC2, AWS.Tools.S3...).\r\nThe module AWS.Tools.Installer (https://www.powershellgallery.com/packages/AWS.Tools.Installer/) makes it easier to install, update and uninstall the AWS.Tools modules.\r\nThis version of AWS Tools for PowerShell is compatible with Windows PowerShell 5.1+ and PowerShell Core 6+ on Windows, Linux and macOS. When running on Windows PowerShell, .NET Framework 4.7.2 or newer is required. Alternative modules AWSPowerShell.NetCore and AWSPowerShell, provide support for all AWS services from a single module and also support older versions of Windows PowerShell and .NET Framework.",
    "MetadataScore": 9
  },
  {
    "id": "AWS.Tools.SSMQuickSetup",
    "Owners": "aws-dotnet-sdk-team",
    "Description": "The SSMQuickSetup module of AWS Tools for PowerShell lets developers and administrators manage AWS Systems Manager QuickSetup from the PowerShell scripting environment. In order to manage each AWS service, install the corresponding module (e.g. AWS.Tools.EC2, AWS.Tools.S3...).\r\nThe module AWS.Tools.Installer (https://www.powershellgallery.com/packages/AWS.Tools.Installer/) makes it easier to install, update and uninstall the AWS.Tools modules.\r\nThis version of AWS Tools for PowerShell is compatible with Windows PowerShell 5.1+ and PowerShell Core 6+ on Windows, Linux and macOS. When running on Windows PowerShell, .NET Framework 4.7.2 or newer is required. Alternative modules AWSPowerShell.NetCore and AWSPowerShell, provide support for all AWS services from a single module and also support older versions of Windows PowerShell and .NET Framework.",
    "MetadataScore": 9
  },
  {
    "id": "AWS.Tools.QApps",
    "Owners": "aws-dotnet-sdk-team",
    "Description": "The QApps module of AWS Tools for PowerShell lets developers and administrators manage Amazon Q Apps from the PowerShell scripting environment. In order to manage each AWS service, install the corresponding module (e.g. AWS.Tools.EC2, AWS.Tools.S3...).\r\nThe module AWS.Tools.Installer (https://www.powershellgallery.com/packages/AWS.Tools.Installer/) makes it easier to install, update and uninstall the AWS.Tools modules.\r\nThis version of AWS Tools for PowerShell is compatible with Windows PowerShell 5.1+ and PowerShell Core 6+ on Windows, Linux and macOS. When running on Windows PowerShell, .NET Framework 4.7.2 or newer is required. Alternative modules AWSPowerShell.NetCore and AWSPowerShell, provide support for all AWS services from a single module and also support older versions of Windows PowerShell and .NET Framework.",
    "MetadataScore": 9
  },
  {
    "id": "Zyborg.Vault",
    "Owners": "ebekker-posh",
    "Description": "PowerShell bindings for HashiCorp Vault.\r\n\r\nProvides cmdlets that talk directly to the Vault REST API and are comparable to most commands available through the official Vault CLI without any dependency on the CLI.",
    "MetadataScore": 9
  },
  {
    "id": "xWebAdministration",
    "Owners": "PowerShellTeam,gaelcolas,dsccommunity",
    "Description": "Module with DSC Resources for Web Administration",
    "MetadataScore": 9
  },
  {
    "id": "xSystemSecurity",
    "Owners": "PowerShellTeam,gaelcolas,dsccommunity",
    "Description": "This module contains DSC resources for configuring and managing computer security.",
    "MetadataScore": 9
  },
  {
    "id": "xSCSMA",
    "Owners": "PowerShellTeam,gaelcolas,dsccommunity",
    "Description": "Module with DSC Resources for deployment and configuration of Microsoft System Center Service Management Automation.",
    "MetadataScore": 9
  },
  {
    "id": "xRobocopy",
    "Owners": "PowerShellTeam,gaelcolas,dsccommunity",
    "Description": "This module is used to facilitate large file copies with complex requirements such as multithreading, restarts, and exclusions when recursing content.",
    "MetadataScore": 9
  },
  {
    "id": "xRemoteDesktopSessionHost",
    "Owners": "PowerShellTeam,gaelcolas,dsccommunity",
    "Description": "Module with DSC Resources for Remote Desktop Session Host",
    "MetadataScore": 9
  },
  {
    "id": "xPSDesiredStateConfiguration",
    "Owners": "PowerShellTeam,gaelcolas,dsccommunity",
    "Description": "DSC resources for configuring common operating systems features, files and settings.",
    "MetadataScore": 9
  },
  {
    "id": "xpoTools",
    "Owners": "mazzy",
    "Description": "Powershell advanced functions to split and to merge XPO files contains AOT objects of Microsoft Dynamics AX (Axapta) 3.0, 4.0, 2009, 2012",
    "MetadataScore": 9
  },
  {
    "id": "xHyper-V",
    "Owners": "PowerShellTeam,gaelcolas,dsccommunity",
    "Description": "This module contains DSC resources for deployment and configuration of Microsoft Hyper-V.",
    "MetadataScore": 9
  },
  {
    "id": "xFailOverCluster",
    "Owners": "PowerShellTeam,gaelcolas,dsccommunity",
    "Description": "Module containing DSC resources for deployment and configuration of Windows Server Failover Cluster.",
    "MetadataScore": 9
  },
  {
    "id": "xExchange",
    "Owners": "PowerShellTeam,gaelcolas,dsccommunity",
    "Description": "Module with DSC Resources for deployment and configuration of Microsoft Exchange Server.",
    "MetadataScore": 9
  },
  {
    "id": "xDscDiagnostics",
    "Owners": "PowerShellTeam,gaelcolas,dsccommunity",
    "Description": "Module to help in reading details from DSC events.",
    "MetadataScore": 9
  },
  {
    "id": "xBitlocker",
    "Owners": "PowerShellTeam,gaelcolas,dsccommunity",
    "Description": "This DSC Module allows you to configure Bitlocker on a single disk, configure a TPM chip, or automatically enable Bitlocker on multiple disks.",
    "MetadataScore": 9
  },
  {
    "id": "WSManDsc",
    "Owners": "dscottraynsford,dsccommunity",
    "Description": "DSC resources for configuring WS-Man.",
    "MetadataScore": 9
  },
  {
    "id": "wrt.helpers",
    "Owners": "maurice.dejong,maurieezzz",
    "Description": "This PowerShell module contains multiple helper functions to help reduce redundant code for our projects and day to day usage.",
    "MetadataScore": 9
  },
  {
    "id": "WriteToLogs",
    "Owners": "pkparsard",
    "Description": "A collection of fuctions to simplify logging output in a variety of formats, which includes:\r\na) Logging simultaneously to the console and a specified log file;\r\nb) Logging to the console and a log file with a time-stamp index at each line;\r\nc) Logging output to only the specified log file.\r\nThe Write-ToConsoleAndLog function displays the specified content on both the PowerShell console and an included log file.\r\nThe Write-WithTime function displays the specified output on both the PowerShell console and an included log file, with a time index at each line of output.\r\nThe Write-ToLogOnly function writes the specified content only to the inlcuded file.\r\nThe function here is similar to using the native ...| Out-File -FilePath <path> syntax",
    "MetadataScore": 9
  },
  {
    "id": "Write-ProgressEx",
    "Owners": "mazzy",
    "Description": "Write-ProgressEx extends the functionality of the standard cmdlet. Write-ProgressEx is a powershell advanced function that provide a simple way to show ProgressBars, PercentComplete and SecondsRemaining.",
    "MetadataScore": 9
  },
  {
    "id": "WindowsOSServicing",
    "Owners": "AshleyHow",
    "Description": "Gets Windows OS servicing information to check if OS is currently serviced. Useful for scripting and automation purposes. Supports Windows 10 and Windows Server 2016 onwards.",
    "MetadataScore": 9
  },
  {
    "id": "WindowsOSBuild",
    "Owners": "AshleyHow",
    "Description": "Gets Windows patch release information (Version, Build, Availability date, Hotpatch, Preview, Out-of-band, Servicing option, KB article, KB URL and Catalog URL) for Windows client and server versions. Useful for scripting and automation purposes. Supports Windows 10 and Windows Server 2016 onwards. Supports Hotpatch on Windows Server 2022 Azure Edition.",
    "MetadataScore": 9
  },
  {
    "id": "WindowsKeyboardManagement",
    "Owners": "macks",
    "Description": "Allows keys on the physical keyboard to be remapped, and redefine programs associated with multimedia keys. For example, you can remap the \"Scroll Lock\" key to the \"Calculator\" multimedia key, and then redefine \"Calculator\" key to launch PowerShell. Now pressing \"Scroll Lock\" launches PowerShell!",
    "MetadataScore": 9
  },
  {
    "id": "WebAdministrationDsc",
    "Owners": "PowerShellTeam,gaelcolas,dsccommunity",
    "Description": "Module with DSC Resources for Web Administration",
    "MetadataScore": 9
  },
  {
    "id": "vNugglets.VDNetworking",
    "Owners": "MattBoren",
    "Description": "Module with functions for managing VMware vSphere Virtual Distributed Networking components like traffic filtering and marking",
    "MetadataScore": 9
  },
  {
    "id": "vNugglets.Utility",
    "Owners": "MattBoren",
    "Description": "Module with the super useful functions that were previously scattered about the web by the vNugglets team (particularly, at vNugglets.com)",
    "MetadataScore": 9
  },
  {
    "id": "VMware.CloudFoundation.Reporting",
    "Owners": "VMware,GaryJBlake,tenthirtyam",
    "Description": "PowerShell Module for VMware Cloud Foundation Reporting",
    "MetadataScore": 9
  },
  {
    "id": "VMware.CloudFoundation.PowerManagement",
    "Owners": "VMware,GaryJBlake,tenthirtyam",
    "Description": "PowerShell Module for VMware Cloud Foundation Power Management",
    "MetadataScore": 9
  },
  {
    "id": "VMware.CloudFoundation.PasswordManagement",
    "Owners": "VMware,GaryJBlake,tenthirtyam",
    "Description": "PowerShell Module for VMware Cloud Foundation Password Management",
    "MetadataScore": 9
  },
  {
    "id": "VMware.CloudFoundation.CertificateManagement",
    "Owners": "VMware,GaryJBlake,tenthirtyam",
    "Description": "PowerShell Module for VMware Cloud Foundation Certificate Management",
    "MetadataScore": 9
  },
  {
    "id": "VcRedist",
    "Owners": "aaronparker",
    "Description": "A module for lifecycle management of the Microsoft Visual C++ Redistributables. VcRedist downloads, installs and uninstalls the supported (and unsupported) Redistributables. Use for local install, gold image creation and update, or importing as applications into the Microsoft Deployment Toolkit, Microsoft Configuration Manager or Microsoft Intune. Supports passive and silent installs, and uninstalls of the Visual C++ Redistributables.",
    "MetadataScore": 9
  },
  {
    "id": "UpdateServicesDsc",
    "Owners": "gaelcolas,migreene,dsccommunity",
    "Description": "Module with DSC Resources for deployment and configuration of Windows Server Update Services.",
    "MetadataScore": 9
  },
  {
    "id": "TUN.Logging",
    "Owners": "echalone",
    "Description": "Provides easy to use file and mail logging. Documentation of module at https://github.com/echalone/TUN/blob/master/PowerShell/Modules/TUN.Logging/TUN.Logging.md",
    "MetadataScore": 9
  },
  {
    "id": "TUN.Credentials",
    "Owners": "echalone",
    "Description": "Provides easy to use methods to manage and use credentials. Documentation of module at https://github.com/echalone/TUN/blob/master/PowerShell/Modules/TUN.Credentials/TUN.Credentials.md",
    "MetadataScore": 9
  },
  {
    "id": "TUN.CredentialManager",
    "Owners": "echalone",
    "Description": "Provides access to credentials in the Windows Credential Manager (continuation of CredentialManager by Dave Garnar)",
    "MetadataScore": 9
  },
  {
    "id": "Thycotic.SecretServer",
    "Owners": "RobJagger-Delinea,DelineaIntegrations",
    "Description": "Interact with the Secret Server REST API",
    "MetadataScore": 9
  },
  {
    "id": "SysInfo",
    "Owners": "StephanosCF",
    "Description": "SysInfo module will help you get the system information that you need from local and remote machines.\r\nSysInfo will allow you to utilize CIM cmdlets in an easier way. Instead of trying to find the class name and filter\r\nbased on the return code to get the exact data that you need, you can get what you need with SysInfo module. It\r\nutilizes CIM cmdlets to get the information from local and remote computer but the output of the properties of\r\nthe system components has no codes. Codes have been converted into a more readable format, giving you the\r\nactual meaning of each code. As different types of sizes are provided in bytes, which in many times this is not\r\nhelpful, additional properties will be included in the output, providing you the size also in other format that\r\nwill help you out perform your job.",
    "MetadataScore": 9
  },
  {
    "id": "SumoLogic-Core",
    "Owners": "binyi3377,sumologic",
    "Description": "Module working with Sumo Logic API",
    "MetadataScore": 9
  },
  {
    "id": "StorageDsc",
    "Owners": "PowerShellTeam,gaelcolas,dsccommunity",
    "Description": "DSC resources for managing storage on Windows Servers.",
    "MetadataScore": 9
  },
  {
    "id": "StigRepo",
    "Owners": "Bewillis,jadean,wiwellin",
    "Description": "The Stig-Repo module leverages PowerSTIG and Desired State Configuration to build and drive the STIG Compliance Automation Repository (SCAR) - an automated Infrastructure as Code framework for Security Technical Implementation Guide (STIG) Compliance.\r\n    \r\n    SCAR accelerates Azure readiness and ATO/CCRI processes through automated STIG compliance and digital transformation by establishing an infrastructure as code platform that organizations can customize build on top of to quickly establish and deploy Azure baselines.\r\n    \r\n    Primary Capabilities:\r\n    \r\n    1. Initialize-StigRepo: Builds the STIG Compliance Automation Repository and installs dependencies on the local system\r\n    2. New-SystemData: Scans the Active Directory Environment for targetted systems, determines applicable STIGs, and generates DSC configuration data\r\n    3. Start-DscBuild: Generates DSC Configuration scripts and MOF files for all DSC Nodes\r\n    4. Sync-DscModules: Syncs DSC module dependencies across all DSC Nodes\r\n    5. Set-WinRMConfig: Expands MaxEnvelopSize on all DSC nodes\r\n    6. Get-StigChecklists: Generates STIG Checklists for all applicable STIGs for each DSC Node\r\n    7. Update-StigRepo: Updates/downloads latest dependencies to SCAR Repo and upgrades STIG Data Files\r\n    \r\n    Dependencies\r\n    \r\n    1. Must be executed from an internet-connected system to install module dependencies\r\n    2. Must be executed from a system with the Active Directory module installed.\r\n    3. DSCSM Leverages PowerSTIG to drive the dynamic DSC configurations included withint he module (installed with Build-Repo or Update-ScarRepo)\r\n    4. Powershell Version 5.1 or greater\r\n    \r\n    The STIG Compliance Automation Repository Structure\r\n    SCAR organizes the repository to deploy and document STIGs using the folders listed below:\r\n    \r\n    1. Systems: Folders for each identified Organizational Unit in Active Directory and a Powershell Data file for each identified system.\r\n    2. Configurations: Dynamic PowerSTIG Configurations for that are customized by paremeters provided within system data files.\r\n    3. Artifacts: Consumable items produced by SCAR. SCAR produces DSCConfigs, MOFS, and STIG Checklists out of the box.\r\n    4. Resources: Dependendencies leveraged by SCAR to generate SystemData and Artifacts. SCAR has Modules, Stig Data, and Wiki resources out of the box.",
    "MetadataScore": 9
  },
  {
    "id": "SS.CliMenu",
    "Owners": "johnwcarew",
    "Description": "CLI menu infrastructure for PowerShell. \r\n\tThis is a major modified version of https://github.com/torgro/cliMenu with some advanced features.",
    "MetadataScore": 9
  },
  {
    "id": "SRXEnv",
    "Owners": "Achim",
    "Description": "Provides the ScriptRunner PowerShell Host Environment Variable $SRXEnv for test\r\nand development purposes.\r\n\r\nThe SRXEnv hashtable provides the following keys:\r\n\r\n[string] ReportEmail: (3.10.4133.0)\r\nIf you have an SMTP server available, the ScriptRunner service can send you email\r\nnotifications containing execution reports, on error or on success.\r\nRecipient email address (comma separated list). The full action report will be sent to this address.\r\n\r\n[string] ResultEmail: (3.10.4133.0)\r\nRecipient email addresses (comma separated list). Only the ResultMessage will be sent to this address.\r\n\r\n[string] ResultHtml: (5.2.6155.0)\r\nThe ScriptRunner PowerShell host supports HTML results through the $SRXEnv.ResultHtml variable.\r\nThe HTML web page can then be easily retrieved from the ScriptRunner Portal, Apps and WebApps.\r\nFor example, you can use the ConvertTo-Html cmdlet to assign HTML to the ResultHTML variable.\r\nThere are new sample scripts in the Expl/Common folder of the ScriptRunner ScriptRepository that\r\nshow how to create the HTML in your scripts.\r\n\r\n[ArrayList] ResultList: (4.0.4511.0)\r\nA scripted query must specify this list of string values. The list is associated with\r\nthe corresponding action parameter.\r\n\r\n[ArrayList] ResultList2: (4.0.4511.0)\r\nA scripted query can specify this optional list of display names. The list appears as\r\ndrop-down list for the associated action parameter.\r\n\r\n[string] ResultMessage: (3.00.3670.0)\r\nThis message will show in the reports, and in the immediate result window of the Portal, Delegate and\r\nSelf-Service App.\r\n\r\n[string] ResultObjectJSON: (4.1.4738.0)\r\nThe script can now provide (simple) structured result data by writing a (small) JSON string to $SRXEnv.ResultObjectJSON.\r\nScriptRunner will provide this JSON string in the OutSerializedPSObjects report field,\r\nfor post-processing by the caller of the Web Service Connector.\r\n\r\n[string] SRXActionID: (6.2.577.0)\r\nThe ID of the started Action. (read-only)\r\n\r\n[string] SRXCommandPath: (6.2.642.0)\r\nFull filepath of the executed script file used by the started Action (similar\r\nto the PowerShell $PSCommandPath auto-variable). (read-only)\r\n\r\n[string] SRXDisplayName: (4.1.4738.0)\r\nThe name of the current action. (read-only)\r\n\r\n[string] SRXFilterValue: (6.2.577.0)\r\nIn case of query execution, this key contains the current filter value\r\nfrom the search filter form in the UI. (read-only)\r\n\r\n[DateTime] SRXStarted: (4.1.4738.0)\r\nThe timestamp of the start of the script execution. (read-only)\r\n\r\n[string] SRXStartedBy: (4.1.4738.0)\r\nThe user account that requested the execution of the script. (read-only)\r\n\r\n[string] SRXStartedIP: (4.1.4738.0)\r\nIP address of the client that sent the request to perform the script execution. (read-only)\r\n\r\n[string] SRXStartedReason: (4.1.4738.0)\r\nA reason message written by the user who started the Action. (read-only)\r\n\r\n[string] SRXStartedVia: (4.1.4738.0)\r\nThe name of the application that started the execution of the script. (read-only)\r\n\r\nThe Cmdlet Reset-SRXEnvironment is used to reset the SRXEnv variable. (This Cmdlet is not available in the ScriptRunner PowerShell Host.)",
    "MetadataScore": 9
  },
  {
    "id": "SqlServerDsc",
    "Owners": "PowerShellTeam,gaelcolas,dsccommunity",
    "Description": "Module with DSC resources for deployment and configuration of Microsoft SQL Server.",
    "MetadataScore": 9
  },
  {
    "id": "SharePointPnP.PowerShell.Commands.Files.Recurse",
    "Owners": "RyenTang",
    "Description": "An add-on SharePoint PowerShell module that leverages SharePoint PnP PowerShell module to recursively download or upload of files and folders to or from SharePoint Online.",
    "MetadataScore": 9
  },
  {
    "id": "ServiceNow",
    "Owners": "SamMartin,RickA,Gdbarron",
    "Description": "Automate against ServiceNow service and asset management.  This module can be used standalone, with Azure Automation, or Docker.",
    "MetadataScore": 9
  },
  {
    "id": "ServerEye.Powershell.Helper",
    "Owners": "AndyBehr,stefanie.sander",
    "Description": "Helper to access the servereye API",
    "MetadataScore": 9
  },
  {
    "id": "ServerEye.Powershell.Api",
    "Owners": "AndyBehr,SearchForTheCode,stefanie.sander",
    "Description": "Wrapper for the Server-Eye API",
    "MetadataScore": 9
  },
  {
    "id": "SEPPmailAPI",
    "Owners": "SEPPmail AG",
    "Description": "Receive and manipulate your SEPPmail Appliance beginning with SEPPmail Version 12.1.0.\r\n   With the REST-API you can retrieve and set information via REST, including the option to mass-generate users.\r\n   This PowerShell module is a wrapper around this API to allow more convenient operation and interaction from the command line.",
    "MetadataScore": 9
  },
  {
    "id": "Sentry",
    "Owners": "vaind,sentry-powershell-sdk",
    "Description": "An error reporting module that sends reports to Sentry.io",
    "MetadataScore": 9
  },
  {
    "id": "SecurityPolicyDsc",
    "Owners": "PowerShellTeam,gaelcolas,dsccommunity",
    "Description": "This module is a wrapper around secedit.exe which provides the ability to configure user rights assignments",
    "MetadataScore": 9
  },
  {
    "id": "SecretManagement.Warden",
    "Owners": "WilliamM_iir",
    "Description": "Bitwarden/Vaultwarden extension for the PowerShell SecretManager allowing you to Get, Set, and Remove secrets in a standardized way. Supports storing and retrieving PowerShell Objects as secrets. Can be used for automated secret retrieval/management.",
    "MetadataScore": 9
  },
  {
    "id": "SecretManagement.Keeper",
    "Owners": "saldoukhov-keeper,mustinov-keeper",
    "Description": "SecretManagement extension vault for Keeper",
    "MetadataScore": 9
  },
  {
    "id": "SChannelDsc",
    "Owners": "gaelcolas,YorickKuijs,dsccommunity",
    "Description": "This DSC module is used to manage Secure Channel (SChannel) configurations.",
    "MetadataScore": 9
  },
  {
    "id": "Sampler",
    "Owners": "gaelcolas",
    "Description": "Sample Module with Pipeline scripts and its Plaster template to create a module following some of the community accepted practices.",
    "MetadataScore": 9
  },
  {
    "id": "safeguard-ps",
    "Owners": "petrsnd,safeguard-devops",
    "Description": "Scripting tools for interacting with the One Identity Safeguard Web API.",
    "MetadataScore": 9
  },
  {
    "id": "safeguard-devops",
    "Owners": "petrsnd,safeguard-devops",
    "Description": "Scripting tools for interacting with the One Identity Safeguard Secrets Broker for DevOps.",
    "MetadataScore": 9
  },
  {
    "id": "Rubrik",
    "Owners": "RubrikBuild,Rubrik_Build,guirava,evancheng,mikepreston",
    "Description": "This is a community project that provides a PowerShell module for managing and monitoring Rubrik's Cloud Data Management platform.",
    "MetadataScore": 9
  },
  {
    "id": "RSMassTransit.PowerShell",
    "Owners": "sharpjs",
    "Description": "Provides the Invoke-RsReport cmdlet, which executes a SQL Server Reporting Services report via a MassTransit message bus.",
    "MetadataScore": 9
  },
  {
    "id": "RoyalDocument.PowerShell",
    "Owners": "StefanKoell,hdocsek",
    "Description": [
      []
    ],
    "MetadataScore": 9
  },
  {
    "id": "Rivet",
    "Owners": "pshdo,webmd-health-services,DecoyJoe",
    "Description": "Rivet is a database migration/change management/versioning tool inspired by Ruby on Rails' Migrations. It creates and applies migration scripts for SQL Server databases. Migration scripts describe changes to make to your database, e.g. add a table, add a column, remove an index, etc. Migrations scripts should get added to your version control system so they can be packaged and deployed with your application's code.",
    "MetadataScore": 9
  },
  {
    "id": "Recycle",
    "Owners": "bdukes,bdukes-engage,bdukes-engage1",
    "Description": "Deletes the file or folder as if it had been done via File Explorer, or restores a deleted file from the recycle bin.",
    "MetadataScore": 9
  },
  {
    "id": "Read-Choice",
    "Owners": "bdukes,bdukes-engage,bdukes-engage1",
    "Description": "Prompts the user to pick a choice from a set of options.  Based on http://scriptolog.blogspot.com/2007/09/make-choice.html",
    "MetadataScore": 9
  },
  {
    "id": "QLogicFastLinQPowerKit",
    "Owners": "apps_qlogic",
    "Description": "Marvell/QLogic QConvergeConsole PowerKit is for managing 34xx, 84xx, 41xxx and 45xxx adapters using PowerShell cmdlets on Windows, Linux and VMware_ESXi hosts.",
    "MetadataScore": 9
  },
  {
    "id": "pwshEmojiExplorer",
    "Owners": "jakewmorrison",
    "Description": "Enables detailed emoji search, discovery, and retrieval. Offers detailed insights on emojis, with multiple search options aligned with the Unicode standard. Provides comprehensive emoji data, including diverse representations and formats, to enhance your scripts and digital communication.",
    "MetadataScore": 9
  },
  {
    "id": "pwsh-download-songs",
    "Owners": "nt4f04uNd",
    "Description": "This is simple powershell utility to easily grab and download songs and playlists from popular websites. It automatically inserts metadata to files and embeds cool squared album arts (if .png or .jpg/.jpeg format is available and source file is one of the followings: .mp3, .m4a, .m4b, .m4p, .m4v, .mp4, this is true in most cases).",
    "MetadataScore": 9
  },
  {
    "id": "PSSwaggerUtility",
    "Owners": "PowerShellTeam,manikb,brywang-msft",
    "Description": "PowerShell module with PSSwagger common helper functions.\r\nPlease refer to https://github.com/PowerShell/PSSwagger/blob/developer/README.md for more details.",
    "MetadataScore": 9
  },
  {
    "id": "PSSwagger",
    "Owners": "PowerShellTeam,manikb,brywang-msft",
    "Description": "The PowerShell cmdlet generator from OpenAPI (f.k.a Swagger) specification.\r\nPlease refer to https://github.com/PowerShell/PSSwagger/blob/developer/README.md for more details.",
    "MetadataScore": 9
  },
  {
    "id": "PSScriptTools",
    "Owners": "JeffHicks",
    "Description": "A collection of PowerShell functions designed to enhance your own functions and scripts or to facilitate working in the console. Most of the commands should work in Windows PowerShell and PowerShell 7, even cross-platform. Any operating system limitations should be handled on a per-command basis.",
    "MetadataScore": 9
  },
  {
    "id": "PSScriptAnalyzer",
    "Owners": "PowerShellTeam,JamesTruher-MSFT,andschwa",
    "Description": "PSScriptAnalyzer provides script analysis and checks for potential code defects in the scripts by applying a group of built-in or customized rules on the scripts being analyzed.",
    "MetadataScore": 9
  },
  {
    "id": "PSRule.Rules.GitHub",
    "Owners": "BernieWhite",
    "Description": "A suite of rules to validate GitHub repositories using PSRule.\n\nThis project uses GitHub Issues to track bugs and feature requests. See GitHub project for more information.",
    "MetadataScore": 9
  },
  {
    "id": "PSRule.Rules.Azure",
    "Owners": "BernieWhite",
    "Description": "Validate Azure resources and infrastructure as code using PSRule.\n\nThis project uses GitHub Issues to track bugs and feature requests. See GitHub project for more information.",
    "MetadataScore": 9
  },
  {
    "id": "PSRule.Monitor",
    "Owners": "BernieWhite",
    "Description": "Log PSRule analysis results to Azure Monitor.\n\nThis project uses GitHub Issues to track bugs and feature requests. See GitHub project for more information.",
    "MetadataScore": 9
  },
  {
    "id": "PSRule",
    "Owners": "BernieWhite",
    "Description": "Validate infrastructure as code (IaC) and objects using PowerShell rules.\n\nThis project uses GitHub Issues to track bugs and feature requests. See GitHub project for more information.",
    "MetadataScore": 9
  },
  {
    "id": "PSRAW",
    "Owners": "MarkEKraus",
    "Description": "PowerShell Reddit API Wrapper. See the project site at https://github.com/markekraus/PSRAW and the documentation at https://psraw.readthedocs.io/",
    "MetadataScore": 9
  },
  {
    "id": "PSProjectStatus",
    "Owners": "JeffHicks",
    "Description": "A set of PowerShell tools for tracking module development status. The module uses a JSON file to create a custom object with information about your module. You can use this internally to track the status of your module including a simple to-do tracker. This module was first described at https://jdhitsolutions.com/blog/powershell/8960/introducing-psprojectstatus/",
    "MetadataScore": 9
  },
  {
    "id": "PSProductivityTools",
    "Owners": "JanEgilRing,StaleHansen",
    "Description": "The PSProductivityTools PowerShell module contains commands for productivity tools & topics such as time management.",
    "MetadataScore": 9
  },
  {
    "id": "PSOfflineFOD",
    "Owners": "altCipher",
    "Description": "Installs a Windows capability package from an offline Features on Demand ISO on the specified operating system image. PSOfflineFOD is compatible with both PowerShell 5.x and PowerShell Core 6.",
    "MetadataScore": 9
  },
  {
    "id": "PSItems",
    "Owners": "Eizedev",
    "Description": "A PowerShell module that finds files, file content and directories as well as file and directory information the quick and easy way!",
    "MetadataScore": 9
  }
]