[
  {
    "id": "PSCompletions",
    "Owners": "abgox",
    "Description": "A completion manager for a better and simpler tab-completion experience in PowerShell.\r\n It provides an enhanced scrollable completion menu with sorting and filtering.\r\n  - Website: https://pscompletions.abgox.com\r\n  - Github:  https://github.com/abgox/PSCompletions\r\n  - Gitee:   https://gitee.com/abgox/PSCompletions",
    "Score": 65,
    "Published": "2026-01-03T04:21:34.647"
  },
  {
    "id": "AzRetirementMonitor",
    "Owners": "cocallaw",
    "Description": "A PowerShell module for identifying and monitoring Azure service retirements and deprecation notices of Azure services inyour subscriptions.",
    "Score": 60,
    "Published": "2026-01-03T03:58:25.367"
  },
  {
    "id": "GitlabCli",
    "Owners": "chris-peterson",
    "Description": "Interact with GitLab via PowerShell",
    "Score": 60,
    "Published": "2026-01-03T22:25:23.99"
  },
  {
    "id": "PowerNetbox",
    "Owners": "ctrl-alt-automate",
    "Description": "PowerNetbox - The comprehensive PowerShell module for Netbox REST API with 100% coverage. Fork of NetboxPS (Ben Claussen) with full Netbox 4.x compatibility. 488+ functions for DCIM, IPAM, Virtualization, Circuits, Tenancy, VPN, Wireless, Extras, Core, Users. Cross-platform (Windows, Linux, macOS).",
    "Score": 55,
    "Published": "2026-01-03T16:56:07.683"
  },
  {
    "id": "EasyGUI",
    "Owners": "SecretProgrammer",
    "Description": "EasyGUI is a lightweight PowerShell module for quickly creating graphical user interfaces (GUIs). It provides simple, easy-to-use functions for creating windows, buttons, input boxes, dropdowns, radio buttons, tabs, and more. Designed for simplicity and rapid development, EasyGUI lets PowerShell users build GUIs efficiently for scripts, tools, or utilities.",
    "Score": 50,
    "Published": "2026-01-03T09:10:30.147"
  },
  {
    "id": "UncommonSense.Trouw",
    "Owners": "jhoek",
    "Description": "PowerShell module for listing Trouw articles",
    "Score": 50,
    "Published": "2026-01-03T09:46:31.66"
  },
  {
    "id": "Set-ClipboardFile",
    "Owners": "santarl",
    "Description": "Sets actual files to the Windows clipboard (FileDropList) for pasting into Explorer, emails, or other apps. Unlike Set-Clipboard, this handles the files themselves, not just their text paths.",
    "Score": 45,
    "Published": "2026-01-03T23:10:22.8"
  },
  {
    "id": "LoraxMod",
    "Owners": "jackyHD",
    "Description": "Tree-sitter AST parsing and analysis via PowerShell. Native C# implementation with schema-driven extraction. Supports 28+ languages.",
    "Score": 45,
    "Published": "2026-01-03T07:38:48.32"
  },
  {
    "id": "PowerShellUniversal.Apps.HerdManager",
    "Owners": "steviecoaster",
    "Description": "PowerShell Universal dashboard application for cattle herd management, including weight tracking, rate of gain calculations, health records, feed records with dynamic recipe management, and invoicing capabilities.",
    "Score": 40,
    "Published": "2026-01-03T03:54:24.62"
  },
  {
    "id": "IntuneHydrationKit",
    "Owners": "jorgeasaurus",
    "Description": "Hydrates Microsoft Intune tenants with best-practice baseline configurations including policies, compliance packs, enrollment profiles, dynamic groups, security baselines, and conditional access starter packs.",
    "Score": 40,
    "Published": "2026-01-03T04:49:06.917"
  }
]