[
  {
    "id": "GoogleFonts",
    "Owners": "PSModule.io",
    "Description": "A PowerShell module to download and install fonts from GoogleFonts.",
    "Score": 75,
    "Published": "2026-01-08T07:45:19.98"
  },
  {
    "id": "PoshKelvin",
    "Owners": "igoravl",
    "Description": "This module provides a set of functions to interact with the Kelvin API.",
    "Score": 70,
    "Published": "2026-01-08T21:18:04.547"
  },
  {
    "id": "CAT",
    "Owners": "tomastucek,petr.parik",
    "Description": "Author, run and manage AUTOMATED TESTS for your DATA with minimum effort.",
    "Score": 70,
    "Published": "2026-01-08T09:22:48.907"
  },
  {
    "id": "DatabricksDsc",
    "Owners": "GijsReijn",
    "Description": "This module contains class-based DSC resources for Databricks and Unity Catalog with a focus on Azure.",
    "Score": 65,
    "Published": "2026-01-08T11:33:02.243"
  },
  {
    "id": "PSRule.Rules.Azure",
    "Owners": "BernieWhite",
    "Description": "Validate Azure resources and infrastructure as code using PSRule.\n\nThis project uses GitHub Issues to track bugs and feature requests. See GitHub project for more information.",
    "Score": 65,
    "Published": "2026-01-08T03:24:59.867"
  },
  {
    "id": "UncommonSense.Rws",
    "Owners": "jhoek",
    "Description": "PowerShell module for Rijkswaterstaat information",
    "Score": 60,
    "Published": "2026-01-08T21:02:15.96"
  },
  {
    "id": "New-TaskbarCustomizationXML",
    "Owners": "Vejita",
    "Description": "This script automates the creation of a custom Taskbar layout XML file for Windows systems. It allows users to select shortcuts and applications to be pinned to the Taskbar. The script retrieves existing Taskbar shortcuts and installed applications, presenting them in graphical selection forms. Selected items are then used to generate an XML file that defines the Taskbar layout. It includes functionality to convert file paths to environment variable-based paths for portability. The XML file is structured according to Microsoft's Taskbar layout schema. The script ensures user-friendly interaction through Windows Forms and handles file creation and formatting programmatically. It is designed for IT administrators or advanced users customizing Windows environments.",
    "Score": 60,
    "Published": "2026-01-08T14:52:12.14"
  },
  {
    "id": "Invoke-IntuneWin32AppRedeploy",
    "Owners": "markorr321",
    "Description": "Forces a redeploy of Intune Win32 applications by clearing local registry state and restarting the Intune Management Extension service. Uses Microsoft Graph for app and user name resolution.",
    "Score": 55,
    "Published": "2026-01-08T17:48:02.517"
  },
  {
    "id": "ScreenRecorder",
    "Owners": "ytsuda",
    "Description": "Screen capture tool with clock overlay for debugging and log correlation. No external dependencies required. Can be run directly without module installation.",
    "Score": 50,
    "Published": "2026-01-08T15:21:40.287"
  },
  {
    "id": "WindmillClient",
    "Owners": "rubenfiszel",
    "Description": "Client for the Windmill platform.",
    "Score": 50,
    "Published": "2026-01-08T06:36:34.517"
  }
]