[
  {
    "id": "PSPreworkout",
    "Owners": "SamErde",
    "Description": "A special mix of tools to help jump start your PowerShell session!",
    "Score": 80,
    "Published": "2025-11-27T13:19:17.067"
  },
  {
    "id": "MASES.JNetPS",
    "Owners": "MASESGroupPSTeam",
    "Description": "JNet (.NET suite for Java™/JVM™) PowerShell (aka JNetPS) is a PowerShell Module to use JVM and PowerShell side-by-side. With JNetPS it is possible to:\r\n- create and use JVM objects from PowerShell: initialize JVM object (Java, Scala, Kotlin, ...), execute mehods on the object, read data from the object to be used for further PowerShell code \r\n- send to JVM objects data managed from PowerShell: e.g. data of PowerShell, like an input from command-line or a variable, can be used as an argument for the initialization or execution of a method of a JVM object\r\n\r\nMore information within the project hosted on GitHub at https://github.com/masesgroup/JNet for further information.",
    "Score": 80,
    "Published": "2025-11-27T14:54:40.287"
  },
  {
    "id": "VcRedist",
    "Owners": "aaronparker",
    "Description": "A module for lifecycle management of the Microsoft Visual C++ Redistributables. VcRedist downloads, installs and uninstalls the supported (and unsupported) Redistributables. Use for local install, gold image creation and update, or importing as applications into the Microsoft Deployment Toolkit, Microsoft Configuration Manager or Microsoft Intune. Supports passive and silent installs, and uninstalls of the Visual C++ Redistributables.",
    "Score": 75,
    "Published": "2025-11-27T05:59:43.39"
  },
  {
    "id": "GoogleFonts",
    "Owners": "PSModule.io",
    "Description": "A PowerShell module to download and install fonts from GoogleFonts.",
    "Score": 75,
    "Published": "2025-11-27T09:13:53.38"
  },
  {
    "id": "RelaxedIT.EnergySaver",
    "Owners": "josy1024",
    "Description": "relaxed IT EnergySaver",
    "Score": 70,
    "Published": "2025-11-27T15:33:59.617"
  },
  {
    "id": "dbatools",
    "Owners": "chrissylemaire,FWN,SQLDBAWithABeard,wsmelton,jpomfret",
    "Description": "The community module that enables SQL Server Pros to automate database development and server administration",
    "Score": 70,
    "Published": "2025-11-27T12:25:47.33"
  },
  {
    "id": "Rnwood.Dataverse.Data.PowerShell",
    "Owners": "rnwood",
    "Description": "Dataverse data manipulation cmdlets",
    "Score": 60,
    "Published": "2025-11-27T15:32:11.44"
  },
  {
    "id": "XDRInternals",
    "Owners": "FBader",
    "Description": "XDRInternals",
    "Score": 55,
    "Published": "2025-11-27T21:18:54.387"
  },
  {
    "id": "DatabricksDsc",
    "Owners": "GijsReijn",
    "Description": "This module contains class-based DSC resources for Databricks and Unity Catalog with a focus on Azure.",
    "Score": 55,
    "Published": "2025-11-27T04:45:30.14"
  },
  {
    "id": "PIMActivation",
    "Owners": "SebastianMarkdanner",
    "Description": "PowerShell module for managing Microsoft Entra ID Privileged Identity Management (PIM) role activations through a modern GUI interface. Supports authentication context, bulk operations, and policy compliance. Developed with AI assistance. Requires PowerShell 7+.",
    "Score": 55,
    "Published": "2025-11-27T21:15:47.227"
  }
]